export const faqData = [
  {
    id: "cbt",
    question: "Что такое ЗБТ?",
    answer: "ЗБТ — это Закрытое Бета-Тестирование. На этом этапе на сервер приглашается ограниченное число игроков для тестирования функционала, баланса и стабильности проекта в условиях реальной игры.",
  },
  {
    id: "connect",
    question: "Как подключиться к серверу?",
    answer: "В данный момент сервер находится на стадии разработки, поэтому подключение пока невозможно.",
  },
  {
    id: "rules",
    question: "Какие основные правила на сервере?",
    answer: "Основные правила включают: уважительное поведение, запрет на использование читов, багов и стороннего ПО, дающего преимущество. Полный список правил будет опубликован до начала ЗБТ.",
  },
  {
    id: "donate",
    question: "Есть ли на сервере донат и что он даёт?",
    answer: "Да, будет возможность поддержать проект. Донат предоставляет исключительно косметические элементы, уникальные титулы и удобства, не влияющие на PvP-баланс. Мы строго придерживаемся принципа #NoP2W!",
  },
  {
    id: "core",
    question: "На каком ядре работает сервер и какую платформу он поддерживает?",
    answer: "Сервер работает на модифицированном ядре <a href='https://github.com/NetherGamesMC/PocketMine-MP'>NG-PocketMine-MP</a> от <a href='https://github.com/NetherGamesMC'>NetherGames</a>. Поддерживаемая платформа — <b>Minecraft Bedrock Edition</b>, версии от 1.20 до 1.21.",
  },
  {
    id: "anticheat",
    question: "Как работает античит? Можно ли пожаловаться на нарушителя?",
    answer: "На сервере используется античит <a href='https://github.com/ReinfyTeam/Zuri'>Zuri</a> от <a href='https://github.com/ReinfyTeam'>ReinfyTeam</a>, адаптированный под наш проект. Если вы заметили нечестную игру, используйте команду <code>/report [ник_игрока] [причина]</code> прямо в чате.",
  },
  {
    id: "events",
    question: "Будут ли на сервере ивенты или турниры?",
    answer: "Мы планируем запуск ивентов и турниров после основного релиза.",
  },
  {
    id: "platform",
    question: "Можно ли играть с телефона или только с ПК?",
    answer: "Сервер ориентирован на Bedrock Edition, поэтому вы сможете играть с любых поддерживаемых устройств: Android, iOS, Windows, Xbox и других.",
  },
  {
    id: "progress",
    question: "Когда откроется сервер?",
    answer: "Точной даты пока нет, но вы можете следить за дорожной картой проекта на сайте. ЗБТ откроется после завершения ключевых этапов разработки.",
  },
  {
    id: "crossplay",
    question: "Можно ли будет играть с друзьями с разных устройств?",
    answer: "Да, сервер поддерживает кроссплей между всеми платформами Bedrock Edition. Но справедливости ради, на сервере будет присутсвовать деление на мобильных, консольных, и ПК игроков.",
  },
];
